In [1]:
import pandas as pd
data = [10, 20, 30, 40]
v = pd.Series(data)
print(v)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Age' : [25, 30, 35],
'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)
print(df.tail())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
import pandas as pd
df = pd.read_csv('transactions.csv')
print(df)

,I4127227587819694,8UX5SHHQ-FVEE-5XU7-FBF8-82OINYYK7KSD,1873.26,USD,6,A,P,173.225,connecticut,6840,...,6840.1,CT,US,6840.2,CT.1,US.1,M,0,17,3/8/2007 18:03
0,E9525730529761877,7LF834E4-BLWQ-FJ92-YEYA-85AF05RI2PCX,740.66,USD,13,A,P,81.159,greater london,sw2,...,GU11 1YH,NaN,GB,GU11 1YH,NaN,GB,M,10,19,7/26/2007 2:36
1,Z6376643485803420,8ZFFW0QS-PN3Y-9N5U-28DW-6HFI162RGVVF,1535.15,USD,4,A,P,97.118,colorado,80126,...,80104,CO,US,80104,CO,US,M,6,24,4/7/2007 19:39
2,R8609290025411138,SVV7LJ8A-PG2L-JVNJ-66NF-HDSQ107UQO5N,1324.41,USD,13,A,P,216.150,new york,14534,...,85233,AZ,US,85233,AZ,US,M,9,7,5/16/2007 11:37
3,Y9572700698484288,3SWVJA0R-MZ11-RM1T-E0BJ-XACU1NOQQRNC,697.31,BRL,14,A,P,91.119,wien,1000,...,1220,NaN,AT,1220,NaN,AT,M,0,25,10/18/2007 12:52
4,W9847720367646182,IG442ZIB-TJCR-V83L-0L8J-RHLM8MWX8MFK,575.16,USD,10,A,P,75.115,florida,33578,...,NaN,NaN,US,NaN,NaN,US,M,8,4,2/11/2007 1:59
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
599994,D1595308067004247,3WHRE067-I1NS-HAEM-31XD-HB7NA8AI88PW,345.96,USD,7,A,P,208.130,massachusetts,2090,...,7740,NJ,US,7740,NJ,US,M,3,15,2/14/2007 2:59
599995,J5495623173883302,M6UO86XP-FOI7-GVTB-UJW1-R2EY66PCAJPJ,336.57,USD,10,A,P,78.114,paris,75001,...,69003,NaN,FR,69003,NaN,FR,M,1,4,2/20/2007 18:36
599996,C6028543887959060,Z8U9OVR5-ILKB-J4MI-5TVW-167E4N28NO4G,1851.27,USD,9,A,P,62.140,noord-holland,1099,...,5643 NT,NaN,NL,5643 NT,NaN,NL,M,0,22,2/18/2007 9:11
599997,V6352687558381604,FMBDPLHD-87B7-E3FZ-D70K-NU93TUOHANT2,274.40,USD,1,A,P,99.130,kansas,66250,...,64138,MO,US,64138,MO,US,M,2,11,8/5/2007 14:11
599998,B2862330974862571,JR5AYAHF-SP4Z-WHPN-GZ90-VUEEQWNTPPK6,456.14,USD,10,A,P,131.107,washington,98052,...,107-8420,???,JP,107-8420,???,JP,M,10,20,8/9/2007 22:36

In [39]:
print(df.tail(2)) #to get last 2 rows

   TransactionID TransactionDate  UserID  ProductID  Quantity
8              9      2015-04-24     7.0          4         3
9             10      2016-05-08     3.0          4         4

In [14]:
print(df.head(2)) #to get top 2 rows

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1

In [15]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   TransactionID    10 non-null     int64
 1   TransactionDate  10 non-null     object
 2   UserID           9 non-null      float64
 3   ProductID        10 non-null     int64
 4   Quantity         10 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 528.0+ bytes
None

In [36]:
print(df.describe()) #summary of dataset

               0
count   4.000000
mean   25.000000
std    12.909944
min    10.000000
25%    17.500000
50%    25.000000
75%    32.500000
max    40.000000

In [40]:
print(df['UserID']) #to get a particular row

0    7.0
1    3.0
2    3.0
3    1.0
4    2.0
5    2.0
6    3.0
7    NaN
8    7.0
9    3.0
Name: UserID, dtype: float64

In [41]:
print(df[['ProductID','UserID']]) #to get multiple rows

   ProductID  UserID
0          2     7.0
1          4     3.0
2          3     3.0
3          2     1.0
4          4     2.0
5          5     2.0
6          4     3.0
7          2     NaN
8          4     7.0
9          4     3.0

In [42]:
print(df.iloc[1])

TransactionID               2
TransactionDate    2011-05-26
UserID                    3.0
ProductID                   4
Quantity                    1
Name: 1, dtype: object

In [43]:
filtered_df=df[df['Quantity']>3] #prints rows with quantity>3
print(filtered_df)

   TransactionID TransactionDate  UserID  ProductID  Quantity
5              6      2013-12-23     2.0          5         6
9             10      2016-05-08     3.0          4         4

In [44]:
df.rename(columns={'Quantity':'Quant'},inplace=True)
print(df)

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
1              2      2011-05-26     3.0          4      1
2              3      2011-06-16     3.0          3      1
3              4      2012-08-26     1.0          2      3
4              5      2013-06-06     2.0          4      1
5              6      2013-12-23     2.0          5      6
6              7      2013-12-30     3.0          4      1
7              8      2014-04-24     NaN          2      3
8              9      2015-04-24     7.0          4      3
9             10      2016-05-08     3.0          4      4

In [45]:
print(df.isnull().sum())

TransactionID      0
TransactionDate    0
UserID             1
ProductID          0
Quant              0
dtype: int64

In [46]:
df['UserID'].fillna(df['UserID'].mean(),inplace=True)
print(df)

   TransactionID TransactionDate    UserID  ProductID  Quant
0              1      2010-08-21  7.000000          2      1
1              2      2011-05-26  3.000000          4      1
2              3      2011-06-16  3.000000          3      1
3              4      2012-08-26  1.000000          2      3
4              5      2013-06-06  2.000000          4      1
5              6      2013-12-23  2.000000          5      6
6              7      2013-12-30  3.000000          4      1
7              8      2014-04-24  3.444444          2      3
8              9      2015-04-24  7.000000          4      3
9             10      2016-05-08  3.000000          4      4

/tmp/ipykernel_3040/1174315164.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['UserID'].fillna(df['UserID'].mean(),inplace=True)

In [13]:
#1. Print Summary of transaction data set
print(df.describe())

               0
count   4.000000
mean   25.000000
std    12.909944
min    10.000000
25%    17.500000
50%    25.000000
75%    32.500000
max    40.000000

In [21]:
#2. Print Numbers of Attributes

print(len(df.columns))

    0
0  10
1  20
2  30
3  40
1

In [15]:
#3. Print Numbers of Records
print(len(df))

4

In [70]:
#4. Get the row names

In [71]:
#5. Get the column names

In [16]:
#6. View top 10 Records
print(df.head(10))

    0
0  10
1  20
2  30
3  40

In [17]:
#7.Change the name of column “ Quantity” to “Quant”
df.rename(columns={'Quantity':'Quant'},inplace=True)
print(df)

    0
0  10
1  20
2  30
3  40

In [18]:
#8.Change the name of columns ProductID and UserID to PID and UID respectively
df.rename(columns={'ProductID':'PID','UserID':'UID'},inplace=True)
print(df)

    0
0  10
1  20
2  30
3  40

In [47]:
#9. Order the rows of transactions by TransactionId descending, if ascending then ascending=True
df_asc = df.sort_values(by="TransactionID", ascending=False)
print(df_asc)

   TransactionID TransactionDate    UserID  ProductID  Quant
9             10      2016-05-08  3.000000          4      4
8              9      2015-04-24  7.000000          4      3
7              8      2014-04-24  3.444444          2      3
6              7      2013-12-30  3.000000          4      1
5              6      2013-12-23  2.000000          5      6
4              5      2013-06-06  2.000000          4      1
3              4      2012-08-26  1.000000          2      3
2              3      2011-06-16  3.000000          3      1
1              2      2011-05-26  3.000000          4      1
0              1      2010-08-21  7.000000          2      1

In [48]:
#10. Order the rows of transactions by Quantity ascending, TransactionDate descending
df_sort=df.sort_values(by=['Quant','TransactionDate'],ascending=[True,False])
print(df_sort)

   TransactionID TransactionDate    UserID  ProductID  Quant
6              7      2013-12-30  3.000000          4      1
4              5      2013-06-06  2.000000          4      1
2              3      2011-06-16  3.000000          3      1
1              2      2011-05-26  3.000000          4      1
0              1      2010-08-21  7.000000          2      1
8              9      2015-04-24  7.000000          4      3
7              8      2014-04-24  3.444444          2      3
3              4      2012-08-26  1.000000          2      3
9             10      2016-05-08  3.000000          4      4
5              6      2013-12-23  2.000000          5      6

In [51]:
#11. Set the column order of Transactions as ProductID,Quantity, TransactionDate, TransactionID, UserID
select=['ProductID','Quant','TransactionDate','TransactionID','UserID']
df_s=df[select]
print(df_s)

   ProductID  Quant TransactionDate  TransactionID    UserID
0          2      1      2010-08-21              1  7.000000
1          4      1      2011-05-26              2  3.000000
2          3      1      2011-06-16              3  3.000000
3          2      3      2012-08-26              4  1.000000
4          4      1      2013-06-06              5  2.000000
5          5      6      2013-12-23              6  2.000000
6          4      1      2013-12-30              7  3.000000
7          2      3      2014-04-24              8  3.444444
8          4      3      2015-04-24              9  7.000000
9          4      4      2016-05-08             10  3.000000

In [103]:
#12. Make UserID the first column of transactions
columns_order = ['UID'] + [col for col in df.columns if col != 'UID']
df_reordered = df[columns_order]
print(df_reordered)

        UID  TransactionID TransactionDate  PID  Quant
0  7.000000              1      2010-08-21    2      1
1  3.000000              2      2011-05-26    4      1
2  3.000000              3      2011-06-16    3      1
3  1.000000              4      2012-08-26    2      3
4  2.000000              5      2013-06-06    4      1
5  2.000000              6      2013-12-23    5      6
6  3.000000              7      2013-12-30    4      1
7  3.444444              8      2014-04-24    2      3
8  7.000000              9      2015-04-24    4      3
9  3.000000             10      2016-05-08    4      4

In [52]:
#13. Extracting arrays from a Data Frame. Get the 2nd column
print(df.iloc[2])

TransactionID               3
TransactionDate    2011-06-16
UserID                    3.0
ProductID                   3
Quant                       1
Name: 2, dtype: object

In [54]:
#14. Get the ProductID Array
print(df.ProductID)

0    2
1    4
2    3
3    2
4    4
5    5
6    4
7    2
8    4
9    4
Name: ProductID, dtype: int64

In [55]:
#16.Row subsetting, subset rows 1,3 and 6
sub=df.iloc[[1,3,6]]
print(sub)

   TransactionID TransactionDate  UserID  ProductID  Quant
1              2      2011-05-26     3.0          4      1
3              4      2012-08-26     1.0          2      3
6              7      2013-12-30     3.0          4      1

In [56]:
#17. subset rows excluding 1,3 and 6
rows=[1,3,6]
sub=df.drop(index=rows)
print(sub)

   TransactionID TransactionDate    UserID  ProductID  Quant
0              1      2010-08-21  7.000000          2      1
2              3      2011-06-16  3.000000          3      1
4              5      2013-06-06  2.000000          4      1
5              6      2013-12-23  2.000000          5      6
7              8      2014-04-24  3.444444          2      3
8              9      2015-04-24  7.000000          4      3
9             10      2016-05-08  3.000000          4      4

In [57]:
#18. Subset the first three rows
sub=df.head(3)
print(sub)

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
1              2      2011-05-26     3.0          4      1
2              3      2011-06-16     3.0          3      1

In [58]:
#19. Subset the last 2 rows
sub=df.tail(2)
print(sub)

   TransactionID TransactionDate  UserID  ProductID  Quant
8              9      2015-04-24     7.0          4      3
9             10      2016-05-08     3.0          4      4

In [59]:
#20. Subset rows excluding the last 2 rows
dfs=df[:-2]
print(dfs)

   TransactionID TransactionDate    UserID  ProductID  Quant
0              1      2010-08-21  7.000000          2      1
1              2      2011-05-26  3.000000          4      1
2              3      2011-06-16  3.000000          3      1
3              4      2012-08-26  1.000000          2      3
4              5      2013-06-06  2.000000          4      1
5              6      2013-12-23  2.000000          5      6
6              7      2013-12-30  3.000000          4      1
7              8      2014-04-24  3.444444          2      3

In [60]:
#21. Subset rows excluding the first 3 rows
dfs=df[3:]
print(dfs)

   TransactionID TransactionDate    UserID  ProductID  Quant
3              4      2012-08-26  1.000000          2      3
4              5      2013-06-06  2.000000          4      1
5              6      2013-12-23  2.000000          5      6
6              7      2013-12-30  3.000000          4      1
7              8      2014-04-24  3.444444          2      3
8              9      2015-04-24  7.000000          4      3
9             10      2016-05-08  3.000000          4      4

In [61]:
#22. Subset rows where Quantity>1
subset = df[df['Quant'] > 1]
print(subset)

   TransactionID TransactionDate    UserID  ProductID  Quant
3              4      2012-08-26  1.000000          2      3
5              6      2013-12-23  2.000000          5      6
7              8      2014-04-24  3.444444          2      3
8              9      2015-04-24  7.000000          4      3
9             10      2016-05-08  3.000000          4      4

In [63]:
#23. Subset rows where UserID=2
subset=df[df['UserID']==2]
print(subset)

   TransactionID TransactionDate  UserID  ProductID  Quant
4              5      2013-06-06     2.0          4      1
5              6      2013-12-23     2.0          5      6

In [64]:
#24. Subset rows where Quantity>1 and UserID=2
subset=df[(df['UserID']==2) & (df['Quant']>1)]
print(subset)

   TransactionID TransactionDate  UserID  ProductID  Quant
5              6      2013-12-23     2.0          5      6

In [65]:
#25. Subset rows where Quantity + UserID is >3
subset=df[df['UserID']+df['Quant']>3]
print(subset)

   TransactionID TransactionDate    UserID  ProductID  Quant
0              1      2010-08-21  7.000000          2      1
1              2      2011-05-26  3.000000          4      1
2              3      2011-06-16  3.000000          3      1
3              4      2012-08-26  1.000000          2      3
5              6      2013-12-23  2.000000          5      6
6              7      2013-12-30  3.000000          4      1
7              8      2014-04-24  3.444444          2      3
8              9      2015-04-24  7.000000          4      3
9             10      2016-05-08  3.000000          4      4

In [66]:
#26. Subset rows where an external array, foo, is True
foo = [True, False, True, False, False, True, False, False, True, False] # Example of a boolean array
subset_rows = df[foo]
print(subset_rows)

   TransactionID TransactionDate  UserID  ProductID  Quant
0              1      2010-08-21     7.0          2      1
2              3      2011-06-16     3.0          3      1
5              6      2013-12-23     2.0          5      6
8              9      2015-04-24     7.0          4      3

In [148]:
#27. Subset rows where an external array, bar, is positive

In [10]:
#30. Subset by columns 1 and 3

    0
0  10
1  20
2  30
3  40

In [67]:
#31. Subset by columns TransactionID and TransactionDate
cols=['TransactionID','TransactionDate']
sub=df[cols]
sub

   TransactionID TransactionDate
0              1      2010-08-21
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
4              5      2013-06-06
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08

In [84]:
#32. Subset by columns TransactionID and TransactionDate with logical operator
df = pd.read_csv('transactions.csv')

df_subset = df[(df["Quantity"] > 2) | (df["UserID"] == 3)][["TransactionID", "TransactionDate"]]
print(df_subset)

   TransactionID TransactionDate
1              2      2011-05-26
2              3      2011-06-16
3              4      2012-08-26
5              6      2013-12-23
6              7      2013-12-30
7              8      2014-04-24
8              9      2015-04-24
9             10      2016-05-08